---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RevealProfileParam
source: html/f755eafc-b398-7571-d384-a96a8571ae4d.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RevealProfileParam Property

"Profile"

## Syntax (C#)
```csharp
public static ForgeTypeId RevealProfileParam { get; }
```